In [1]:
import pandas as pd
import sqlalchemy as sa
from sqlalchemy import create_engine

In [2]:
engine = create_engine('mysql://root:root@localhost/dt28')

In [3]:
from sqlalchemy import text

# Customer Analysis

# ●	Demographic Distribution : Analyze the distribution of customers based on gender, age (calculated from birthday), location (city, state, country, continent).

In [4]:
query = '''
    select 
  drv_age,
 CASE
        WHEN drv_age BETWEEN 18 AND 24 THEN 'Age 18-24'
        WHEN drv_age BETWEEN 25 AND 34 THEN 'Age 25-34'
        WHEN drv_age BETWEEN 35 AND 44 THEN 'Age 35-44'
        WHEN drv_age BETWEEN 45 AND 54 THEN 'Age 45-54'
        ELSE 'Age 55+'
    END AS age_group,
 Gender,Continent, City, State_x,  count(CustomerKey) as customer_count  from sales_dim
 group by drv_age,age_group,Continent, State_x,Gender,City -- having age_group = 'Age 25-34'
 order by customer_count desc,age_group desc, Gender limit 10
'''

df = pd.read_sql_query(query, engine)
df.head()

,drv_age,age_group,Gender,Continent,City,State_x,customer_count
0,33,Age 25-34,Male,Europe,Galdo Degli Alburni,Salerno,36
1,70,Age 55+,Female,North America,Los Angeles,California,35
2,75,Age 55+,Female,North America,Fort Lauderdale,Florida,33
3,76,Age 55+,Male,North America,Tampa,Florida,32
4,83,Age 55+,Male,North America,Minneapolis,Minnesota,32

# Purchase Patterns : Identify purchasing patterns such as average order value, frequency of purchases, and preferred products.

In [9]:
query = '''
   select  Order_Date, Product_Name, count(Quantity) as cnt, avg(der_unit_cost_val) from sales_dim
group by  Order_Date, Product_Name having cnt > 1
order by cnt, Order_Date desc limit 10
'''

df = pd.read_sql_query(query, engine)
df.head()

,Order_Date,Product_Name,cnt,avg(der_unit_cost_val)
0,2021-02-20,SV Hand Games for Office worker L28 Red,2,6.396524
1,2021-02-20,SV DVD 12-Inch Player Portable M400 White,2,58.981902
2,2021-02-19,WWI Desktop PC2.33 X2330 White,2,344.214640
3,2021-02-18,WWI 1GB Digital Voice Recorder Pen E100 Pink,2,90.135325
4,2021-02-18,Adventure Works Desktop PC1.80 ED182 White,2,254.860000

# ●	Segmentation:  Segment customers based on demographics and purchasing behavior to identify key customer groups.

In [10]:
query = '''
   select 
  drv_age,
 CASE
        WHEN drv_age BETWEEN 18 AND 24 THEN 'Age 18-24'
        WHEN drv_age BETWEEN 25 AND 34 THEN 'Age 25-34'
        WHEN drv_age BETWEEN 35 AND 44 THEN 'Age 35-44'
        WHEN drv_age BETWEEN 45 AND 54 THEN 'Age 45-54'
        ELSE 'Age 55+'
    END AS age_group,
 Gender,Continent, order_date, Product_Name,  Avg(der_unit_price_val)  , count(CustomerKey) as customer_count  from sales_dim
 group by drv_age,age_group,Continent, order_date,Gender,Product_Name having age_group = 'Age 25-34'
 order by customer_count desc,order_date desc limit 10
'''

df = pd.read_sql_query(query, engine)
df.head()

,drv_age,age_group,Gender,Continent,order_date,Product_Name,Avg(der_unit_price_val),customer_count
0,26,Age 25-34,Female,North America,2021-01-26,"The Phone Company Touch Screen Phones 26-2.2"" ...",230.000000,2
1,25,Age 25-34,Male,Europe,2020-05-30,WWI Desktop PC1.60 E1600 Silver,197.515100,2
2,29,Age 25-34,Female,North America,2020-05-15,Contoso Rechargeable Battery E100 Grey,12.950000,2
3,28,Age 25-34,Male,North America,2020-05-05,Contoso Touch Stylus Pen E150 Silver,9.990000,2
4,25,Age 25-34,Female,Europe,2020-02-08,SV Hand Games women M40 Yellow,8.095896,2

# Sales Analysis

# ●	Overall Sales Performance : Analyze total sales over time, identifying trends and seasonality

In [11]:
query = '''
   select month(order_date) AS sal_month,
sum(der_unit_cost_val) as total_sal_in_usd, count(*) as sal_count from sales_dim
group by sal_month
order by sal_month limit 10
'''

df = pd.read_sql_query(query, engine)
df.head()

   sal_month  total_sal_in_usd  sal_count
0          1     884658.830959       7683
1          2     986396.145300       8464
2          3     335036.489498       2760
3          4      77520.546054        640
4          5     620622.761457       5341

# ●	Sales by Product:  Evaluate which products are the top performers in terms of quantity sold and revenue generated.

In [12]:
query = '''
   SELECT ProductKey, Product_Name, count(Quantity) as Quantity_Sold,
   (der_unit_price_val - der_unit_cost_val) AS profit,  
    ROUND(((der_unit_price_val - der_unit_cost_val) / der_unit_price_val) * 100, 2) AS profit_percentage  
FROM sales_dim
group by ProductKey, Product_Name, profit,profit_percentage
ORDER BY Quantity_Sold desc, profit_percentage DESC limit 10
'''

df = pd.read_sql_query(query, engine)
df.head()

,ProductKey,Product_Name,Quantity_Sold,profit,profit_percentage
0,418,Adventure Works Desktop PC1.60 ED160 Silver,100,132.32,49.02
1,434,Adventure Works Desktop PC2.30 MD230 White,94,323.54,54.01
2,444,WWI Desktop PC2.33 X2330 Black,92,614.52,66.87
3,452,WWI Desktop PC1.60 E1600 Red,89,107.81,49.02
4,451,WWI Desktop PC2.30 M2300 Silver,87,301.94,54.01

# ●	Sales by Store:  Assess the performance of different stores based on sales data.

In [13]:
query = '''
   select order_date, sum(der_unit_price_val - der_unit_cost_val) AS profit,StoreKey,Country_y,Square_Meters from sales_dim
group by order_date,StoreKey,Country_y,Square_Meters
order by order_date desc, profit desc limit 10
'''

df = pd.read_sql_query(query, engine)
df.head()

  order_date       profit  StoreKey      Country_y  Square_Meters
0 2021-02-20  3515.723376         0         Online            0.0
1 2021-02-20  1279.710000        55  United States         2000.0
2 2021-02-20  1086.226125         5      Australia         2000.0
3 2021-02-20   606.290000        54  United States         2000.0
4 2021-02-20   516.900000        45  United States         2000.0

# ●	Sales by Currency : Examine how different currencies impact sales figures, considering exchange rates.

In [14]:
query = '''
   select currency, sum(Unit_Cost_USD) as total_sale, sum(der_unit_cost_val) as total_sal_in_usd, count(*)  from sales_dim
group by currency
order by total_sal_in_usd desc limit 10
'''

df = pd.read_sql_query(query, engine)
df.head()

  currency  total_sale  total_sal_in_usd  count(*)
0      USD  3927951.05      3.927951e+06     33767
1      EUR  1459972.39      1.289520e+06     12621
2      CAD   628864.37      8.274626e+05      5415
3      GBP   943519.02      7.256557e+05      8140
4      AUD   350147.66      4.877316e+05      2941

# 	Product Analysis

# Product Popularity: Identify the most  and least popular products based on sales data.

In [16]:
query = '''
select order_date, product_Name,count(*) from sales_dim
group by order_date, product_name
order by count(*) desc
limit 5;

select order_date, product_Name,count(*) from sales_dim
group by order_date, product_name
order by count(*)
limit 5;
'''

df = pd.read_sql_query(query, engine)
df.head()

  order_date                                 product_Name  count(*)
0 2020-01-04               WWI Desktop PC2.33 X2330 Black         4
1 2019-01-11  Adventure Works Desktop PC2.33 XD233 Silver         4
2 2019-01-02   Adventure Works Desktop PC1.80 ED182 Black         3
3 2019-05-16               WWI Desktop PC1.80 E1800 White         3
4 2017-12-27   Adventure Works Desktop PC1.60 ED160 Brown         3

# 	Profitability Analysis : Calculate profit margins for products by comparing unit cost and unit price.

In [17]:
query = '''
SELECT ProductKey, Product_Name,der_unit_price_val,der_unit_cost_val,
    (der_unit_price_val - der_unit_cost_val) AS profit,  -- Calculate the profit per unit
    ROUND(((der_unit_price_val - der_unit_cost_val) / der_unit_price_val) * 100, 2) AS profit_percentage  -- Calculate the profit margin percentage
FROM sales_dim
ORDER BY profit_percentage DESC
limit 5;
'''

df = pd.read_sql_query(query, engine)
df.head()

,ProductKey,Product_Name,der_unit_price_val,der_unit_cost_val,profit,profit_percentage
0,1590,SV DVD 60 DVD Storage Binder L20 Silver,17.238459,5.708498,11.529961,66.89
1,1585,SV DVD 60 DVD Storage Binder L20 Black,20.868813,6.910686,13.958127,66.89
2,1635,Contoso DVD 60 DVD Storage Binder L20 Silver,17.787819,5.890418,11.897401,66.89
3,1630,Contoso DVD 60 DVD Storage Binder L20 Black,20.214159,6.693898,13.520261,66.89
4,1635,Contoso DVD 60 DVD Storage Binder L20 Silver,20.619312,6.828064,13.791248,66.89

# Category Analysis : Analyze sales performance across different product categories and subcategories.

In [18]:
query = '''
select product_Name, Subcategory, category, sum(der_unit_cost_val) as sum_cost from sales_dim
group by  product_Name, Subcategory, category
order by sum_cost desc
limit 5;
'''

df = pd.read_sql_query(query, engine)
df.head()

,product_Name,Subcategory,category,sum_cost
0,Adventure Works Desktop PC2.33 XD233 Black,Desktops,Computers,48086.676370
1,WWI Desktop PC2.33 X2330 Black,Desktops,Computers,47120.654944
2,Adventure Works Desktop PC2.33 XD233 Brown,Desktops,Computers,46163.426345
3,Adventure Works Desktop PC2.33 XD233 Silver,Desktops,Computers,45929.027740
4,Adventure Works Desktop PC2.33 XD233 White,Desktops,Computers,45257.134300

# Store Analysis

# Store Performance: Evaluate  store performance based on sales, size (square meters), and operational data (open date).

In [19]:
query = '''
select
    quantity as Sales_Quantity, 
	-- Currency_Code as sales_currency_cd, 
	open_date as store_open_date, 
	Square_Meters as store_sq_meter, 
    sum(der_unit_cost_val) as sum_sold   
from sales_dim
-- where der_unit_cost_val <> 0
group by 	quantity, open_date, Square_Meters
order by sum_sold desc, Sales_Quantity desc,Square_Meters desc,open_date desc

limit 5;
'''

df = pd.read_sql_query(query, engine)
df.head()

   Sales_Quantity store_open_date  store_sq_meter       sum_sold
0               1      2010-01-01             0.0  418507.792387
1               2      2010-01-01             0.0  348225.942545
2               3      2010-01-01             0.0  267194.128633
3               4      2010-01-01             0.0  130838.251285
4               1      2008-03-06          2000.0  110807.516604

# Geographical Analysis: Analyze  sales by store location to identify high-performing regions.

In [20]:
query = '''
select
	Continent, 
    Country_x,
	 State_x,
     City,
    sum(der_unit_cost_val) as sum_sold   
from sales_dim
-- where der_unit_cost_val <> 0
group by 	Continent,Country_x, State_x, City
order by sum_sold desc
limit 5;
'''

df = pd.read_sql_query(query, engine)
df.head()

       Continent      Country_x     State_x         City       sum_sold
0  North America         Canada     Ontario      Toronto  102274.689808
1  North America  United States    New York     New York   65688.140000
2  North America  United States  California  Los Angeles   62796.540000
3  North America  United States       Texas      Houston   52430.840000
4  North America         Canada      Quebec     Montreal   52075.166556